NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_transport_lpn.c
/* Copyright (c) 2010 - 2018, Nordic Semiconductor ASA
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 * list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */

#include "unity.h"

#include "transport.h"
#include "packet_mesh.h"
#include "log.h"

#include "bearer_event_mock.h"
#include "network_mock.h"
#include "nrf_mesh_mock.h"
#include "enc_mock.h"
#include "timer_mock.h"
#include "timer_scheduler_mock.h"
#include "event_mock.h"
#include "replay_cache_mock.h"
#include "nrf_mesh_externs_mock.h"
#include "core_tx_mock.h"
#include "net_state_mock.h"
#include "mesh_lpn_mock.h"
#include "mesh_lpn_internal_mock.h"
#include "nrf_mesh_events_mock.h"

#include "manual_mock_queue.h"

#define BEARER_FLAG   0xDEADBABE
#define MY_ADDRESS    0x0010
#define OTHER_ADDRESS 0x0020
#define SEQZERO       0x8
#define MIC_BYTE      0x55

/* Unsegmented message with AKF=1 */
#define UNSEGMENTED_ACCESS_PDU {0x40, 0x01, 0x02, 0x03, 0x04, 0x05,     \
                                0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B}

/* Segmented access PDU. SeqZero=123, SegO=SEQZERO, SegN=1. */
#define SEGMENTED_ACCESS_PDU_1 {0xC0, 0x00, (SEQZERO << 2), 0x01, 0x04, 0x05, \
                                0x06, 0x07, 0x08, 0x09, 0x0A, 0x0B}


#define ACCESS_NET_METADATA                                             \
    {                                                                   \
        .dst = {NRF_MESH_ADDRESS_TYPE_UNICAST, MY_ADDRESS, NULL},       \
        .src = OTHER_ADDRESS,                                           \
        .ttl = 1,                                                       \
        .control_packet = false,                                        \
        .internal = {0, 0},                                             \
        .p_security_material = &m_default_network_secmat                \
    }

#define DEFAULT_TX_PARAMS                                               \
    {                                                                   \
        .dst = {NRF_MESH_ADDRESS_TYPE_UNICAST, OTHER_ADDRESS, NULL},    \
        .src = MY_ADDRESS,                                              \
        .ttl = 1,                                                       \
        .force_segmented = false,                                       \
        .transmic_size = NRF_MESH_TRANSMIC_SIZE_DEFAULT,                \
        .p_data = NULL,                                                 \
        .data_len = 0,                                                  \
        .security_material = {.p_net = &m_default_network_secmat,       \
                              .p_app = &m_default_app_secmat},          \
        .tx_token = 0                                                   \
    }

typedef struct
{
    uint8_t * p_payload;
    uint32_t length;
} pdu_queue_data_t;

/* Forward declaration */
static void pdu_queue_elem_free(pdu_queue_data_t * p_data);

MOCK_QUEUE_DEF(network_packet_queue, pdu_queue_data_t, pdu_queue_elem_free);
MOCK_QUEUE_DEF(alloc_packet_queue, pdu_queue_data_t, pdu_queue_elem_free);

static nrf_mesh_evt_t m_expected_evt;
static bool m_in_friendship;
static const nrf_mesh_network_secmat_t m_default_network_secmat;
static const nrf_mesh_application_secmat_t m_default_app_secmat = {.is_device_key = false};
static timer_event_t * mp_timeout_timer;
static nrf_mesh_evt_handler_t * mp_mesh_evt_handler;
static int m_expected_timer_sch_reschedules;
static uint32_t m_seqnum;
static bearer_event_flag_callback_t m_bearer_event_cb;

/*****************************************************************************
 * Stubs
 *****************************************************************************/

static void nrf_mesh_evt_handler_add_stub(nrf_mesh_evt_handler_t * p_evt_handler, int num_calls)
{
    nrf_mesh_evt_handler_add_StubWithCallback(NULL);
    mp_mesh_evt_handler = p_evt_handler;
}

static void event_handle_stub(const nrf_mesh_evt_t * p_evt, int num_calls)
{
    TEST_ASSERT_EQUAL(m_expected_evt.type, p_evt->type);
    if (p_evt->type == NRF_MESH_EVT_SAR_FAILED)
    {
        TEST_ASSERT_EQUAL(m_expected_evt.params.sar_failed.reason, p_evt->params.sar_failed.reason);
    }
    event_handle_StubWithCallback(NULL);
}

