NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_transport_lpn.c
static uint32_t network_packet_alloc_stub(network_tx_packet_buffer_t * p_buffer, int num_calls)
{
    TEST_ASSERT_NOT_NULL(p_buffer);
    TEST_ASSERT(network_packet_queue_Pending());

    pdu_queue_data_t data;
    data.p_payload = malloc(p_buffer->user_data.payload_len);
    TEST_ASSERT_NOT_NULL_MESSAGE(data.p_payload, "malloc failed");
    data.length = p_buffer->user_data.payload_len;
    alloc_packet_queue_Expect(&data);

    p_buffer->p_payload = data.p_payload;
    p_buffer->user_data.p_metadata->internal.sequence_number = m_seqnum;
    m_seqnum++;
    return NRF_SUCCESS;
}

static void network_packet_send_stub(const network_tx_packet_buffer_t * p_buffer, int num_calls)
{
    TEST_ASSERT_NOT_NULL(p_buffer);
    TEST_ASSERT_NOT_NULL(p_buffer->p_payload);

    pdu_queue_data_t expected_data;
    pdu_queue_data_t actual_data;

    network_packet_queue_Consume(&expected_data);
    alloc_packet_queue_Consume(&actual_data);

    TEST_ASSERT_MESSAGE(actual_data.p_payload == p_buffer->p_payload,
                        "Unexpected user payload pointer. Most likely network_packet_alloc() was "
                        "called two or more times before network_packet_send(). This test expects "
                        "only one allocation at a time.");

    TEST_ASSERT_EQUAL(expected_data.length, p_buffer->user_data.payload_len);

    packet_mesh_trs_packet_t * p_packet = (packet_mesh_trs_packet_t *) p_buffer->p_payload;
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "seqzero %u, sego %u, segn %u\n",
          packet_mesh_trs_seg_seqzero_get(p_packet),
          packet_mesh_trs_seg_sego_get(p_packet),
          packet_mesh_trs_seg_segn_get(p_packet));
    TEST_ASSERT_EQUAL_MEMORY(expected_data.p_payload, p_buffer->p_payload, expected_data.length);

    free(actual_data.p_payload);
    free(expected_data.p_payload);
}

static void timer_sch_reschedule_stub(timer_event_t * p_timer_evt, timestamp_t new_timestamp, int num_calls)
{
    TEST_ASSERT(num_calls <= m_expected_timer_sch_reschedules);
    switch (num_calls)
    {
        case 0:
            /* Incomplete timer (in RX) or TX retry timer (in TX). */
            mp_timeout_timer = p_timer_evt;
            mp_timeout_timer->timestamp = new_timestamp;
            break;

        case 1:
            /* ACK timer */
        default:
            break;
    }
}

void enc_aes_ccm_encrypt_stub(ccm_soft_data_t * ccm_data, int num_calls)
{
    memset(ccm_data->p_mic, MIC_BYTE, ccm_data->mic_len);
    enc_aes_ccm_encrypt_StubWithCallback(NULL);
}

bearer_event_flag_t bearer_event_flag_add_stub(bearer_event_flag_callback_t callback, int num_calls)
{
    m_bearer_event_cb = callback;
    bearer_event_flag_add_StubWithCallback(NULL);
    return BEARER_FLAG;
}

/*****************************************************************************
 * Helper functions
 *****************************************************************************/

static void pdu_queue_elem_free(pdu_queue_data_t * p_data)
{
    TEST_ASSERT_NOT_NULL(p_data);
    TEST_ASSERT_NOT_NULL(p_data->p_payload);
    free(p_data->p_payload);
}

static void network_packet_Expect(const uint8_t * p_payload, uint32_t length)
{
    pdu_queue_data_t data;
    data.p_payload = malloc(length);
    TEST_ASSERT_NOT_NULL_MESSAGE(data.p_payload, "malloc failed");

    data.length = length;
    memcpy(data.p_payload, p_payload, length);
    network_packet_queue_Expect(&data);
}

static void block_ack_Expect(uint16_t seqzero, uint32_t block_ack)
{
    packet_mesh_trs_packet_t packet;
    packet_mesh_trs_control_packet_t * p_control_packet =
        (packet_mesh_trs_control_packet_t *) &packet.pdu[PACKET_MESH_TRS_CONTROL_OPCODE_OFFSET + 1];

    memset(&packet, 0, sizeof(packet));
    packet_mesh_trs_control_opcode_set(&packet, TRANSPORT_CONTROL_OPCODE_SEGACK);
    packet_mesh_trs_control_segack_seqzero_set(p_control_packet, seqzero);
    packet_mesh_trs_control_segack_block_ack_set(p_control_packet, block_ack);
    network_packet_Expect(packet.pdu, PACKET_MESH_TRS_CONTROL_SEGACK_SIZE + PACKET_MESH_TRS_UNSEG_PDU_OFFSET);
}

static void segmented_packet_Expect(const uint8_t * p_payload, uint32_t length, uint16_t seqzero, uint8_t sego, uint8_t segn)
{
    packet_mesh_trs_packet_t packet;
    memset(&packet, 0, sizeof(packet));
    packet_mesh_trs_common_seg_set(&packet, 1);
    packet_mesh_trs_access_akf_set(&packet, 1);
    packet_mesh_trs_seg_segn_set(&packet, segn);
    packet_mesh_trs_seg_sego_set(&packet, sego);
    packet_mesh_trs_seg_seqzero_set(&packet, seqzero);
    memcpy(&packet.pdu[PACKET_MESH_TRS_SEG_PDU_OFFSET], p_payload, length);
    network_packet_Expect(packet.pdu, PACKET_MESH_TRS_SEG_PDU_OFFSET + length);
}

static void decrypt_Expect(void)
{
    enc_nonce_generate_ExpectAnyArgs();
    /* No keys => no decryption. */
    nrf_mesh_app_secmat_next_get_ExpectAnyArgs();
}

static void encrypt_Expect(void)
{
    enc_nonce_generate_ExpectAnyArgs();
    enc_aes_ccm_encrypt_StubWithCallback(enc_aes_ccm_encrypt_stub);
}

static void incomplete_timer_reschedule_Expect(void)
{
    m_expected_timer_sch_reschedules++;
    timer_sch_reschedule_StubWithCallback(timer_sch_reschedule_stub);
    timer_now_ExpectAndReturn(0);
}

static void ack_timer_reschedule_Expect(void)
{
    m_expected_timer_sch_reschedules++;
    timer_now_ExpectAndReturn(0);
}

static void tx_retry_timer_reschedule_Expect(void)
{
    m_expected_timer_sch_reschedules++;
    timer_sch_reschedule_StubWithCallback(timer_sch_reschedule_stub);
    timer_now_ExpectAndReturn(0);
}

static void sar_cancel_evt_Expect(nrf_mesh_sar_session_cancel_reason_t reason)
{
    event_handle_StubWithCallback(event_handle_stub);
    m_expected_evt.type = NRF_MESH_EVT_SAR_FAILED;
    m_expected_evt.params.sar_failed.reason = reason;
}

static void sar_tx_ctx_free_Expect(void)
{
    timer_sch_is_scheduled_IgnoreAndReturn(true);
    timer_sch_abort_ExpectAnyArgs();
    net_state_iv_index_lock_Expect(false);
}

static void sar_rx_ctx_free_Expect(void)
{
    timer_sch_is_scheduled_IgnoreAndReturn(!m_in_friendship);
    timer_sch_is_scheduled_IgnoreAndReturn(!m_in_friendship);
    if (!m_in_friendship)
    {
        /* Incomplete timer. */
        timer_sch_abort_ExpectAnyArgs();
        /* ACK timer. */
        timer_sch_abort_ExpectAnyArgs();
    }
    net_state_iv_index_lock_Expect(false);
}

static void transport_packet_in_Expect(void)
{
    static nrf_mesh_address_t dst_addr = {.type = NRF_MESH_ADDRESS_TYPE_UNICAST,
                                          .value = MY_ADDRESS,
                                          .p_virtual_uuid = NULL};

