NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_transport_lpn.c
    mesh_lpn_rx_notify_ExpectAnyArgs();
    nrf_mesh_rx_address_get_ExpectAndReturn(dst_addr.value, NULL, true);
    nrf_mesh_rx_address_get_IgnoreArg_p_address();
    nrf_mesh_rx_address_get_ReturnThruPtr_p_address(&dst_addr);
    replay_cache_has_elem_IgnoreAndReturn(false);
    replay_cache_add_IgnoreAndReturn(NRF_SUCCESS);
    bearer_event_critical_section_begin_Expect();
    bearer_event_critical_section_end_Expect();
}

static void incomplete_timeout_trigger(void)
{
    TEST_ASSERT_NOT_NULL(mp_timeout_timer);
    mp_timeout_timer->cb(mp_timeout_timer->timestamp, mp_timeout_timer->p_context);
}

static void tx_retry_timeout_trigger(void)
{
    incomplete_timeout_trigger();
}

static void mesh_event_send(nrf_mesh_evt_type_t evt_type)
{
    TEST_ASSERT_NOT_NULL(mp_mesh_evt_handler);
    nrf_mesh_evt_t evt;
    memset(&evt, 0, sizeof(evt));
    evt.type = evt_type;
    mp_mesh_evt_handler->evt_cb(&evt);
}

static void expect_init(void)
{
    replay_cache_init_Expect();
    bearer_event_flag_add_StubWithCallback(bearer_event_flag_add_stub);
    core_tx_complete_cb_set_ExpectAnyArgs();
    nrf_mesh_evt_handler_add_StubWithCallback(nrf_mesh_evt_handler_add_stub);
}

static void receive_first_segment(void)
{
    const packet_mesh_trs_packet_t packet = {.pdu = SEGMENTED_ACCESS_PDU_1};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    transport_packet_in_Expect();

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    if (!m_in_friendship)
    {
        incomplete_timer_reschedule_Expect();
        ack_timer_reschedule_Expect();
    }
    net_state_iv_index_lock_Expect(true);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

static void segack_receive(uint16_t seqzero, uint32_t block_ack)
{
    network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    net_metadata.control_packet = true;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    packet_mesh_trs_packet_t packet;
    packet_mesh_trs_control_packet_t * p_control_packet =
        (packet_mesh_trs_control_packet_t *) &packet.pdu[PACKET_MESH_TRS_CONTROL_OPCODE_OFFSET + 1];

    memset(&packet, 0, sizeof(packet));
    packet_mesh_trs_control_opcode_set(&packet, TRANSPORT_CONTROL_OPCODE_SEGACK);
    packet_mesh_trs_control_segack_seqzero_set(p_control_packet, seqzero);
    packet_mesh_trs_control_segack_block_ack_set(p_control_packet, block_ack);
    transport_packet_in_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS,
                      transport_packet_in(
                          &packet, PACKET_MESH_TRS_CONTROL_SEGACK_SIZE + 1, &net_metadata, &rx_metadata));
}

/*****************************************************************************
 * Tests
 *****************************************************************************/

void setUp(void)
{
    bearer_event_mock_Init();
    network_mock_Init();
    nrf_mesh_mock_Init();
    enc_mock_Init();
    timer_mock_Init();
    timer_scheduler_mock_Init();
    event_mock_Init();
    replay_cache_mock_Init();
    nrf_mesh_externs_mock_Init();
    core_tx_mock_Init();
    net_state_mock_Init();
    mesh_lpn_mock_Init();
    mesh_lpn_internal_mock_Init();
    network_packet_queue_Init();
    alloc_packet_queue_Init();
    __LOG_INIT(~0, LOG_LEVEL_DBG3, LOG_CALLBACK_DEFAULT);

    m_seqnum = SEQZERO;
    m_expected_timer_sch_reschedules = 0;
    m_in_friendship = false;
    memset(&m_expected_evt, 0, sizeof(m_expected_evt));
    network_packet_alloc_StubWithCallback(network_packet_alloc_stub);
    network_packet_send_StubWithCallback(network_packet_send_stub);

    expect_init();
    transport_init(NULL);
}

void tearDown(void)
{
    network_packet_queue_Verify();
    network_packet_queue_Destroy();
    alloc_packet_queue_Verify();
    alloc_packet_queue_Destroy();

    bearer_event_mock_Verify();
    bearer_event_mock_Destroy();
    network_mock_Verify();
    network_mock_Destroy();
    nrf_mesh_mock_Verify();
    nrf_mesh_mock_Destroy();
    enc_mock_Verify();
    enc_mock_Destroy();
    timer_mock_Verify();
    timer_mock_Destroy();
    timer_scheduler_mock_Verify();
    timer_scheduler_mock_Destroy();
    event_mock_Verify();
    event_mock_Destroy();
    replay_cache_mock_Verify();
    replay_cache_mock_Destroy();
    nrf_mesh_externs_mock_Verify();
    nrf_mesh_externs_mock_Destroy();
    core_tx_mock_Verify();
    core_tx_mock_Destroy();
    net_state_mock_Verify();
    net_state_mock_Destroy();
    mesh_lpn_mock_Verify();
    mesh_lpn_mock_Destroy();
    mesh_lpn_internal_mock_Verify();
    mesh_lpn_internal_mock_Destroy();
}

/*****************************************************************************
 * RX path
 *****************************************************************************/

void test_rx_notify_before_replay_check(void)
{
    const packet_mesh_trs_packet_t packet = {.pdu = UNSEGMENTED_ACCESS_PDU};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    mesh_lpn_rx_notify_ExpectAnyArgs();
    nrf_mesh_rx_address_get_IgnoreAndReturn(true);
    replay_cache_has_elem_IgnoreAndReturn(true);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

void test_unsegmented_packet_in(void)
{
    const packet_mesh_trs_packet_t packet = {.pdu = UNSEGMENTED_ACCESS_PDU};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    transport_packet_in_Expect();
    decrypt_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

void test_receive_first_segment(void)
{
    m_in_friendship = true;
    receive_first_segment();
}


void test_ignoring_old_segments(void)
{
    m_in_friendship = true;
    receive_first_segment();

    packet_mesh_trs_packet_t packet = {.pdu = SEGMENTED_ACCESS_PDU_1};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    transport_packet_in_Expect();

