NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_transport_lpn.c
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    packet_mesh_trs_seg_sego_set(&packet, 1);
    packet_mesh_trs_seg_seqzero_set(&packet, SEQZERO-1);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));

    /* Reset the seqzero and complete the transaction. */
    packet_mesh_trs_seg_seqzero_set(&packet, SEQZERO);
    packet_mesh_trs_seg_sego_set(&packet, 1);

    transport_packet_in_Expect();

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    sar_rx_ctx_free_Expect();

    decrypt_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}


void test_cancel_existing_session_if_new(void)
{
    m_in_friendship = true;
    receive_first_segment();

    packet_mesh_trs_packet_t packet = {.pdu = SEGMENTED_ACCESS_PDU_1};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    transport_packet_in_Expect();

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    /* SeqZero is new and the existing session is cancelled. */
    packet_mesh_trs_seg_seqzero_set(&packet, SEQZERO+1);

    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_PEER_STARTED_ANOTHER_SESSION);
    sar_rx_ctx_free_Expect();

    /* A new session is created. */
    net_state_iv_index_lock_Expect(true);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));

    /* Complete the new transaction. */
    packet_mesh_trs_seg_sego_set(&packet, 1);
    transport_packet_in_Expect();

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    sar_rx_ctx_free_Expect();
    decrypt_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

void test_receive_full_transaction(void)
{
    m_in_friendship = true;
    receive_first_segment();

    packet_mesh_trs_packet_t packet = {.pdu = SEGMENTED_ACCESS_PDU_1};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    transport_packet_in_Expect();

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    sar_rx_ctx_free_Expect();

    /* Final segment. */
    packet_mesh_trs_seg_sego_set(&packet, 1);

    decrypt_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

void test_normal_behavior_when_not_in_friendship(void)
{
    m_in_friendship = false;
    packet_mesh_trs_packet_t packet = {.pdu = SEGMENTED_ACCESS_PDU_1};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    receive_first_segment();

    /* Final segment. */
    packet_mesh_trs_seg_sego_set(&packet, 1);

    transport_packet_in_Expect();
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    /* Incomplete timer is rescheduled (then aborted again...) */
    incomplete_timer_reschedule_Expect();

    block_ack_Expect(SEQZERO, 0x3);
    sar_rx_ctx_free_Expect();
    decrypt_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

void test_rx_fail_when_poll_complete(void)
{
    m_in_friendship = true;
    receive_first_segment();

    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_REASON_LPN_RX_NOT_COMPLETE);
    sar_rx_ctx_free_Expect();
    mesh_event_send(NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE);
}

void test_no_poll_when_rx_times_out(void)
{
    m_in_friendship = false;
    receive_first_segment();

    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_REASON_TIMEOUT);
    sar_rx_ctx_free_Expect();
    incomplete_timeout_trigger();
}

void test_sar_rx_fail_on_friendship_termination(void)
{
    m_in_friendship = true;
    receive_first_segment();

    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_REASON_FRIENDSHIP_TERMINATED);
    sar_rx_ctx_free_Expect();
    m_in_friendship = false;
    mesh_event_send(NRF_MESH_EVT_FRIENDSHIP_TERMINATED);
}

void test_sar_rx_fail_on_friendship_establishment(void)
{
    m_in_friendship = false;
    receive_first_segment();

    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_REASON_FRIENDSHIP_ESTABLISHED);
    sar_rx_ctx_free_Expect();
    m_in_friendship = true;
    mesh_event_send(NRF_MESH_EVT_FRIENDSHIP_ESTABLISHED);
}

void test_sar_always_room_for_an_rx_in_friendship(void)
{
    m_in_friendship = true;

    /* Receive one segment. Should be placed in reserved RX context/buffer. */
    receive_first_segment();

    /* Fill up the remaining (TX) contexts.  */
    nrf_mesh_tx_params_t tx_params = DEFAULT_TX_PARAMS;
    const uint8_t access_pdu[12] = {0xde, 0xad, 0xbe, 0xef, 0xde, 0xad, 0xca, 0xfe, 0xde, 0xad, 0xba, 0xbe};
    const uint8_t mic[4] = {MIC_BYTE, MIC_BYTE, MIC_BYTE, MIC_BYTE};
    tx_params.p_data = access_pdu;
    tx_params.data_len = sizeof(access_pdu);

    for (uint32_t i = 0; i < TRANSPORT_SAR_SESSIONS_MAX-1; ++i)
    {
        net_state_iv_index_lock_Expect(true);
        encrypt_Expect();

        segmented_packet_Expect(access_pdu, sizeof(access_pdu), SEQZERO + 2*i, 0, 1);
        segmented_packet_Expect(mic, sizeof(mic), SEQZERO + 2*i, 1, 1);

        tx_retry_timer_reschedule_Expect();
        TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx(&tx_params, NULL));

        // Pick different destinations for every packet to avoid duplicate sessions
        tx_params.dst.value++;
    }

    /* All the contexts should be allocated now. */
    TEST_ASSERT_EQUAL(NRF_ERROR_NO_MEM, transport_tx(&tx_params, NULL));

    /* Send new segment. See that the previous RX session is canceled and the new one is started. */
    packet_mesh_trs_packet_t packet = {.pdu = SEGMENTED_ACCESS_PDU_1};
    const network_packet_metadata_t net_metadata = ACCESS_NET_METADATA;
    const nrf_mesh_rx_metadata_t rx_metadata = {0};

    transport_packet_in_Expect();

