NordicSemiconductor/nRF5-SDK-for-Mesh/mesh/test/src/ut_transport_lpn.c
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    /* SeqZero is new and the existing session is cancelled. */
    packet_mesh_trs_seg_seqzero_set(&packet, SEQZERO+1);

    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_PEER_STARTED_ANOTHER_SESSION);
    sar_rx_ctx_free_Expect();

    /* A new session is created. */
    net_state_iv_index_lock_Expect(true);

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));

    /* Complete the new transaction. */
    packet_mesh_trs_seg_sego_set(&packet, 1);
    transport_packet_in_Expect();

    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);

    sar_rx_ctx_free_Expect();
    decrypt_Expect();

    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_packet_in(&packet, sizeof(packet.pdu), &net_metadata, &rx_metadata));
}

/*****************************************************************************
 * TX path
 *****************************************************************************/

void test_poll_on_tx_retry_timeout(void)
{
    m_in_friendship = true;
    nrf_mesh_tx_params_t tx_params = DEFAULT_TX_PARAMS;
    const uint8_t access_pdu[12] = {0xde, 0xad, 0xbe, 0xef, 0xde, 0xad, 0xca, 0xfe, 0xde, 0xad, 0xba, 0xbe};
    const uint8_t mic[4] = {MIC_BYTE, MIC_BYTE, MIC_BYTE, MIC_BYTE};
    tx_params.p_data = access_pdu;
    tx_params.data_len = sizeof(access_pdu);

    net_state_iv_index_lock_Expect(true);
    encrypt_Expect();

    segmented_packet_Expect(access_pdu, sizeof(access_pdu), SEQZERO, 0, 1);
    segmented_packet_Expect(mic, sizeof(mic), SEQZERO, 1, 1);

    tx_retry_timer_reschedule_Expect();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx(&tx_params, NULL));

    for (uint32_t i = 0; i < TRANSPORT_SAR_TX_RETRIES_DEFAULT; ++i)
    {
        __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "TX retry: %u/%u\n", i, TRANSPORT_SAR_TX_RETRIES_DEFAULT);

        /* Retry timer should trigger a poll(). */
        mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);
        mesh_lpn_friend_poll_ExpectAndReturn(0, NRF_SUCCESS);
        tx_retry_timeout_trigger();

        /* On the POLL_COMPLETE, the state is reset and bearer event flag triggered. */
        bearer_event_flag_set_Expect(BEARER_FLAG);
        mesh_event_send(NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE);

        /* Calling the bearer event callback, triggers sending of segments and resetting of retry
         * timer. */
        segmented_packet_Expect(access_pdu, sizeof(access_pdu), SEQZERO, 0, 1);
        segmented_packet_Expect(mic, sizeof(mic), SEQZERO, 1, 1);
        tx_retry_timer_reschedule_Expect();
        m_bearer_event_cb();
    }

    /* Final segment. */
    __LOG(LOG_SRC_TEST, LOG_LEVEL_INFO, "TX retry: %u/%u\n", 4, TRANSPORT_SAR_TX_RETRIES_DEFAULT);

    /* Retry timer should trigger a poll(). */
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);
    mesh_lpn_friend_poll_ExpectAndReturn(0, NRF_SUCCESS);
    tx_retry_timeout_trigger();

    /* On the final POLL_COMPLETE, the SAR TX is considered failed. */
    sar_cancel_evt_Expect(NRF_MESH_SAR_CANCEL_REASON_RETRY_OVER);
    sar_rx_ctx_free_Expect();
    mesh_event_send(NRF_MESH_EVT_LPN_FRIEND_POLL_COMPLETE);
}


void test_successful_tx_while_waiting_for_poll_complete(void)
{
    m_in_friendship = true;
    nrf_mesh_tx_params_t tx_params = DEFAULT_TX_PARAMS;
    const uint8_t access_pdu[12] = {0xde, 0xad, 0xbe, 0xef, 0xde, 0xad, 0xca, 0xfe, 0xde, 0xad, 0xba, 0xbe};
    const uint8_t mic[4] = {MIC_BYTE, MIC_BYTE, MIC_BYTE, MIC_BYTE};
    tx_params.p_data = access_pdu;
    tx_params.data_len = sizeof(access_pdu);

    net_state_iv_index_lock_Expect(true);
    encrypt_Expect();

    segmented_packet_Expect(access_pdu, sizeof(access_pdu), SEQZERO, 0, 1);
    segmented_packet_Expect(mic, sizeof(mic), SEQZERO, 1, 1);

    tx_retry_timer_reschedule_Expect();
    TEST_ASSERT_EQUAL(NRF_SUCCESS, transport_tx(&tx_params, NULL));

    /* Retry timer should trigger a poll(). */
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);
    mesh_lpn_friend_poll_ExpectAndReturn(0, NRF_SUCCESS);
    tx_retry_timeout_trigger();

    /* ACK the first segment. Expect the second segment to be sent again. */
    segmented_packet_Expect(mic, sizeof(mic), SEQZERO, 1, 1);
    tx_retry_timer_reschedule_Expect();
    segack_receive(SEQZERO, 0x01);

    /* Retry timer should trigger a poll(). */
    mesh_lpn_is_in_friendship_ExpectAndReturn(m_in_friendship);
    mesh_lpn_friend_poll_ExpectAndReturn(0, NRF_SUCCESS);
    tx_retry_timeout_trigger();

    /* ACK second segment -> successful TX. */
    event_handle_StubWithCallback(event_handle_stub);
    m_expected_evt.type = NRF_MESH_EVT_TX_COMPLETE;
    sar_tx_ctx_free_Expect();
    segack_receive(SEQZERO, 0x03);
}
